# Pandas!

In [77]:
import pandas as pd

1. Series
A Series is a one-dimensional labeled array.

It can hold any data type (integers, floats, strings, etc.).

It has an index that labels each element.

Think of it as a column in an Excel sheet or a single list with labels.

## series

In [16]:
# my_series = pd.Series(data,indeex,name)

In [18]:
new_Series = pd.Series(dtype = int)

In [20]:
new_Series

Series([], dtype: int64)

In this example, we're creating an empty series using Pandas. It's like reserving a spot for data, but for now, it's empty. We're telling Pandas that we want it to be a series of whole numbers (dtype = 'int'). It's like setting up a container in advance, even though we haven't put anything in it yet. This can be useful when we plan to add data later on.

#### example

In [26]:
production_data =  [1000,1100,1200,1300,1400,1500,1600]

In [24]:
prodection_day = ['day1','day2','day3','day4','day5','day6','day7',]

In [36]:
my_series = pd.Series(data = production_data,index=prodection_day,name='production details')

In [30]:
my_series

day1    1000
day2    1100
day3    1200
day4    1300
day5    1400
day6    1500
day7    1600
Name: production details, dtype: int64

In [38]:
daily_prodection = pd.Series(data = production_data[1:],index = prodection_day,name = 'production detail')

ValueError: Length of values (6) does not match length of index (7)

In [40]:
my_series.name

'production details'

In [42]:
my_series.index

Index(['day1', 'day2', 'day3', 'day4', 'day5', 'day6', 'day7'], dtype='object')

In [50]:
my_series.values # in here we dont use data we there values of series

array([1000, 1100, 1200, 1300, 1400, 1500, 1600])

In [52]:
my_series.dtype

dtype('int64')

In [54]:
my_series.shape

(7,)

In [60]:
my_series.ndim # dimentional of this serries

1

In [68]:
len(my_series)

7

## DATAFRAMES

pd.DataFrame(data, index, columns, dtype)

In [75]:
cus_data = [
    ['01','anish verma','anis@gmail.com','9818727396',50],
    ['02','harsh verma','harsh@gmail.com','9818725396',70],
    ['03','khushi verma','harsh@gmail.com','9818724396',90]
]

cus_column = [['COSTUMER ID','NAME','EMAIL','PHONE NO.','TOTAL PURCHASE']]

In [79]:
df = pd.DataFrame(data=cus_data,columns=cus_column)

In [81]:
df

  COSTUMER ID          NAME            EMAIL   PHONE NO. TOTAL PURCHASE
0          01   anish verma   anis@gmail.com  9818727396             50
1          02   harsh verma  harsh@gmail.com  9818725396             70
2          03  khushi verma  harsh@gmail.com  9818724396             90

In [84]:
cus_index = ['A','B','C']

In [86]:
df_ind = pd.DataFrame(data = cus_data,index = cus_index,columns =cus_column)

In [88]:
df_ind

  COSTUMER ID          NAME            EMAIL   PHONE NO. TOTAL PURCHASE
A          01   anish verma   anis@gmail.com  9818727396             50
B          02   harsh verma  harsh@gmail.com  9818725396             70
C          03  khushi verma  harsh@gmail.com  9818724396             90

## Creating DataFrames from Dictionaries

In [92]:
cus_dict = {
    'COSTUMER ID ':['A','B','C','D'],
    'NAME':['ANISH','HARSH','KHSUHI','ONI'],
    'EMAIL':['anish@gmail.com','harsh@gmail.com','khushi@gmail.com','oninoni@gmail.com'],
    'PHONE NO.':['9818727396','9818747396','9488727396','9818757396'],
    'PURCHASE':[50,20,10,40]
}

In [98]:
new_df = pd.DataFrame(cus_dict,index = ['a','b','c','d'])

In [100]:
new_df

  COSTUMER ID     NAME              EMAIL   PHONE NO.  PURCHASE
a            A   ANISH    anish@gmail.com  9818727396        50
b            B   HARSH    harsh@gmail.com  9818747396        20
c            C  KHSUHI   khushi@gmail.com  9488727396        10
d            D     ONI  oninoni@gmail.com  9818757396        40

## READING DATA FROM SYSTEM FILE

##### pd.read_csv(filepath_or_buffer, index_col=None, dtype=None)

Let’s look at the function in more detail:

pd.read_csv: This is a function provided by the pandas library specifically designed for reading data from CSV files.

filepath_or_buffer: This is the path or URL of the CSV file you want to read. You should replace filepath_or_buffer with the actual file path or URL.

index_col: This parameter is optional. It specifies which column(s) should be used as the index (row labels) of the resulting DataFrame. If not provided, pandas will automatically assign integer indices.

dtype: This parameter is optional. It allows you to specify the data types for the columns in the DataFrame. If not provided, pandas will infer the data types.

In [103]:
df_read = pd.read_csv('anish.csv')

In [105]:
df_read

   s .no     name  age
0      1    anish   33
1      2   khushi   46
2      3     gori   16
3      4    gopal   25
4      5     gopu   12
5      6   govind   26
6      7    radha   40
7      8  krishna   16
8      9     hari   29
9     10      anu   13

In [111]:
new_read  = pd.read_csv(filepath_or_buffer = 'anish.csv',index_col ='name' )

In [113]:
new_read

         s .no  age
name
anish        1   33
khushi       2   46
gori         3   16
gopal        4   25
gopu         5   12
govind       6   26
radha        7   40
krishna      8   16
hari         9   29
anu         10   13

In [119]:
read_carprice = pd.read_csv('carprices.csv')

In [121]:
read_carprice

,car_ID,symboling,carname,doornumber,carbody,enginelocation,wheelbase,carlength,carwidth,carheight,...,cylindernumber,enginesize,boreratio,stroke,compressionratio,horsepower,peakrpm,citympg,highwaympg,price
0,1,3,alfa-romero giulia,two,convertible,front,88.6,168.8,64.1,48.8,...,four,130,3.47,2.68,9.0,111,5000,21,27,13495.0
1,2,3,alfa-romero stelvio,two,convertible,front,88.6,168.8,64.1,48.8,...,four,130,3.47,2.68,9.0,111,5000,21,27,16500.0
2,3,1,alfa-romero Quadrifoglio,two,hatchback,front,94.5,171.2,65.5,52.4,...,six,152,2.68,3.47,9.0,154,5000,19,26,16500.0
3,4,2,audi 100 ls,four,sedan,front,99.8,176.6,66.2,54.3,...,four,109,3.19,3.40,10.0,102,5500,24,30,13950.0
4,5,2,audi 100ls,four,sedan,front,99.4,176.6,66.4,54.3,...,five,136,3.19,3.40,8.0,115,5500,18,22,17450.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
200,201,-1,volvo 145e (sw),four,sedan,front,109.1,188.8,68.9,55.5,...,four,141,3.78,3.15,9.5,114,5400,23,28,16845.0
201,202,-1,volvo 144ea,four,sedan,front,109.1,188.8,68.8,55.5,...,four,141,3.78,3.15,8.7,160,5300,19,25,19045.0
202,203,-1,volvo 244dl,four,sedan,front,109.1,188.8,68.9,55.5,...,six,173,3.58,2.87,8.8,134,5500,18,23,21485.0
203,204,-1,volvo 246,four,sedan,front,109.1,188.8,68.9,55.5,...,six,145,3.01,3.40,23.0,106,4800,26,27,22470.0
204,205,-1,volvo 264gl,four,sedan,front,109.1,188.8,68.9,55.5,...,four,141,3.78,3.15,9.5,114,5400,19,25,22625.0

In [127]:
read_movierating = pd.read_csv('User_Movie_Ratings.csv',index_col = 'User') # index_col/set_index both are same

In [129]:
read_movierating

,Thor,Justice League,Spiderman,The Notebook,Casablanca,Beauty and the Beast,Dolittle,The Kissing Booth,Annabelle,Insidious
User,,,,,,,,,,
Arnold,6,5,6,4,5,4,9,8,2,1
Ben,9,10,8,3,1,1,2,5,7,8
Catherine,10,8,9,5,6,7,8,5,9,9
Disha,6,7,7,10,9,10,7,6,5,6
Euclid,7,4,3,5,8,5,9,10,8,7
Farhaan,6,5,9,4,4,7,9,9,5,4
Gaurav,8,8,9,3,1,1,7,5,7,7
Hilbert,6,5,8,6,5,8,10,9,2,1
Indira,10,7,9,5,6,4,2,1,6,8
Jason,10,9,9,7,4,6,1,1,5,4
Kenny,3,2,5,9,8,8,4,1,1,3
Lambert,5,6,4,10,9,8,1,2,10,9
Manish,7,6,6,5,6,8,7,6,6,5
Niti,3,3,2,7,8,7,10,9,4,5
Oliver,4,5,4,2,2,1,7,6,1,2
Pranav,8,9,8,4,1,2,3,1,8,7
Qader,8,7,8,5,4,6,3,4,6,5
Ravi,8,7,9,10,9,8,8,8,9,10
Sushant,5,8,6,1,1,2,7,8,6,5
Tavneet,1,1,4,7,6,8,9,10,1,5

In [150]:
dfr = pd.read_clipboard()

In [152]:
dfr.set_index('User')

,Thor,Justice League,Spiderman,The Notebook,Casablanca,Beauty and the Beast,Dolittle,The Kissing Booth,Annabelle,Insidious
User,,,,,,,,,,
Arnold,6,5,6,4,5,4,9,8,2,1
Ben,9,10,8,3,1,1,2,5,7,8
Catherine,10,8,9,5,6,7,8,5,9,9
Disha,6,7,7,10,9,10,7,6,5,6
Euclid,7,4,3,5,8,5,9,10,8,7
Farhaan,6,5,9,4,4,7,9,9,5,4
Gaurav,8,8,9,3,1,1,7,5,7,7
Hilbert,6,5,8,6,5,8,10,9,2,1
Indira,10,7,9,5,6,4,2,1,6,8
Jason,10,9,9,7,4,6,1,1,5,4
Kenny,3,2,5,9,8,8,4,1,1,3
Lambert,5,6,4,10,9,8,1,2,10,9
Manish,7,6,6,5,6,8,7,6,6,5
Niti,3,3,2,7,8,7,10,9,4,5
Oliver,4,5,4,2,2,1,7,6,1,2
Pranav,8,9,8,4,1,2,3,1,8,7
Qader,8,7,8,5,4,6,3,4,6,5
Ravi,8,7,9,10,9,8,8,8,9,10
Sushant,5,8,6,1,1,2,7,8,6,5
Tavneet,1,1,4,7,6,8,9,10,1,5

#### head and tail

In [159]:
read_movierating.head()

,Thor,Justice League,Spiderman,The Notebook,Casablanca,Beauty and the Beast,Dolittle,The Kissing Booth,Annabelle,Insidious
User,,,,,,,,,,
Arnold,6,5,6,4,5,4,9,8,2,1
Ben,9,10,8,3,1,1,2,5,7,8
Catherine,10,8,9,5,6,7,8,5,9,9
Disha,6,7,7,10,9,10,7,6,5,6
Euclid,7,4,3,5,8,5,9,10,8,7

In [161]:
read_movierating.head(3)

,Thor,Justice League,Spiderman,The Notebook,Casablanca,Beauty and the Beast,Dolittle,The Kissing Booth,Annabelle,Insidious
User,,,,,,,,,,
Arnold,6,5,6,4,5,4,9,8,2,1
Ben,9,10,8,3,1,1,2,5,7,8
Catherine,10,8,9,5,6,7,8,5,9,9

In [ ]:
# head show default the first 5 entry and element

In [163]:
read_movierating.tail()

,Thor,Justice League,Spiderman,The Notebook,Casablanca,Beauty and the Beast,Dolittle,The Kissing Booth,Annabelle,Insidious
User,,,,,,,,,,
Pranav,8,9,8,4,1,2,3,1,8,7
Qader,8,7,8,5,4,6,3,4,6,5
Ravi,8,7,9,10,9,8,8,8,9,10
Sushant,5,8,6,1,1,2,7,8,6,5
Tavneet,1,1,4,7,6,8,9,10,1,5

In [165]:
read_movierating.tail(2)

,Thor,Justice League,Spiderman,The Notebook,Casablanca,Beauty and the Beast,Dolittle,The Kissing Booth,Annabelle,Insidious
User,,,,,,,,,,
Sushant,5,8,6,1,1,2,7,8,6,5
Tavneet,1,1,4,7,6,8,9,10,1,5

In [ ]:
# tail show default last 5 entry

In [175]:
read_carprice.axes

[RangeIndex(start=0, stop=205, step=1),
 Index(['car_ID', 'symboling', 'carname', 'doornumber', 'carbody',
        'enginelocation', 'wheelbase', 'carlength', 'carwidth', 'carheight',
        'curbweight', 'cylindernumber', 'enginesize', 'boreratio', 'stroke',
        'compressionratio', 'horsepower', 'peakrpm', 'citympg', 'highwaympg',
        'price'],
       dtype='object')]

In [177]:
read_carprice.index

RangeIndex(start=0, stop=205, step=1)

In [179]:
read_carprice.columns

Index(['car_ID', 'symboling', 'carname', 'doornumber', 'carbody',
       'enginelocation', 'wheelbase', 'carlength', 'carwidth', 'carheight',
       'curbweight', 'cylindernumber', 'enginesize', 'boreratio', 'stroke',
       'compressionratio', 'horsepower', 'peakrpm', 'citympg', 'highwaympg',
       'price'],
      dtype='object')

In [181]:
len(read_carprice)

205

In [183]:
read_carprice.shape

(205, 21)

In [185]:
read_carprice.size

4305

In [187]:
read_carprice.dtypes

car_ID                int64
symboling             int64
carname              object
doornumber           object
carbody              object
enginelocation       object
wheelbase           float64
carlength           float64
carwidth            float64
carheight           float64
curbweight            int64
cylindernumber       object
enginesize            int64
boreratio           float64
stroke              float64
compressionratio    float64
horsepower            int64
peakrpm               int64
citympg               int64
highwaympg            int64
price               float64
dtype: object

In [191]:
read_carprice.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 205 entries, 0 to 204
Data columns (total 21 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   car_ID            205 non-null    int64
 1   symboling         205 non-null    int64
 2   carname           205 non-null    object
 3   doornumber        205 non-null    object
 4   carbody           205 non-null    object
 5   enginelocation    205 non-null    object
 6   wheelbase         205 non-null    float64
 7   carlength         205 non-null    float64
 8   carwidth          205 non-null    float64
 9   carheight         205 non-null    float64
 10  curbweight        205 non-null    int64
 11  cylindernumber    205 non-null    object
 12  enginesize        205 non-null    int64
 13  boreratio         205 non-null    float64
 14  stroke            205 non-null    float64
 15  compressionratio  205 non-null    float64
 16  horsepower        205 non-null    int64
 17  peakrpm           205 non-null    int64
 18  citympg           205 non-null    int64
 19  highwaympg        205 non-null    int64
 20  price             205 non-null    float64
dtypes: float64(8), int64(8), object(5)
memory usage: 33.8+ KB

In [193]:
read_carprice.keys()

Index(['car_ID', 'symboling', 'carname', 'doornumber', 'carbody',
       'enginelocation', 'wheelbase', 'carlength', 'carwidth', 'carheight',
       'curbweight', 'cylindernumber', 'enginesize', 'boreratio', 'stroke',
       'compressionratio', 'horsepower', 'peakrpm', 'citympg', 'highwaympg',
       'price'],
      dtype='object')

In [199]:
read_carprice.values

array([[1, 3, 'alfa-romero giulia', ..., 21, 27, 13495.0],
       [2, 3, 'alfa-romero stelvio', ..., 21, 27, 16500.0],
       [3, 1, 'alfa-romero Quadrifoglio', ..., 19, 26, 16500.0],
       ...,
       [203, -1, 'volvo 244dl', ..., 18, 23, 21485.0],
       [204, -1, 'volvo 246', ..., 26, 27, 22470.0],
       [205, -1, 'volvo 264gl', ..., 19, 25, 22625.0]],
      shape=(205, 21), dtype=object)

In [201]:
read_movierating.transpose()

User,Arnold,Ben,Catherine,Disha,Euclid,Farhaan,Gaurav,Hilbert,Indira,Jason,Kenny,Lambert,Manish,Niti,Oliver,Pranav,Qader,Ravi,Sushant,Tavneet
Thor,6,9,10,6,7,6,8,6,10,10,3,5,7,3,4,8,8,8,5,1
Justice League,5,10,8,7,4,5,8,5,7,9,2,6,6,3,5,9,7,7,8,1
Spiderman,6,8,9,7,3,9,9,8,9,9,5,4,6,2,4,8,8,9,6,4
The Notebook,4,3,5,10,5,4,3,6,5,7,9,10,5,7,2,4,5,10,1,7
Casablanca,5,1,6,9,8,4,1,5,6,4,8,9,6,8,2,1,4,9,1,6
Beauty and the Beast,4,1,7,10,5,7,1,8,4,6,8,8,8,7,1,2,6,8,2,8
Dolittle,9,2,8,7,9,9,7,10,2,1,4,1,7,10,7,3,3,8,7,9
The Kissing Booth,8,5,5,6,10,9,5,9,1,1,1,2,6,9,6,1,4,8,8,10
Annabelle,2,7,9,5,8,5,7,2,6,5,1,10,6,4,1,8,6,9,6,1
Insidious,1,8,9,6,7,4,7,1,8,4,3,9,5,5,2,7,5,10,5,5